Revit 2024 API
BuiltInFailures.PartMakerMethodForMergePartFailures.UnableToIncludePartInMerge Property
 Attempt to merge this Part results in failure of boolean operation. Cannot compute combined geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnableToIncludePartInMerge { get; }
Visual Basic
Public Shared ReadOnly Property UnableToIncludePartInMerge As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnableToIncludePartInMerge {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PartMakerMethodForMergePartFailures Class
Autodesk.Revit.DB Namespace